benchmark/results/throughput_mc-vs-rust/RAW/flare-plaintext-throughput_mc-cal-36426.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   806.38us  484.51us  15.66ms   74.90%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  796.00us
 75.000%    1.11ms
 90.000%    1.31ms
 99.000%    1.69ms
 99.900%    4.89ms
 99.990%   13.05ms
 99.999%   15.34ms
100.000%   15.67ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.034     0.000000            1         1.00
       0.260     0.100000        36298         1.11
       0.402     0.200000        72327         1.25
       0.541     0.300000       108555         1.43
       0.670     0.400000       144652         1.67
       0.796     0.500000       180852         2.00
       0.858     0.550000       198960         2.22
       0.922     0.600000       217165         2.50
       0.983     0.650000       235042         2.86
       1.047     0.700000       253306         3.33
       1.109     0.750000       271262         4.00
       1.141     0.775000       280370         4.44
       1.172     0.800000       289418         5.00
       1.203     0.825000       298271         5.71
       1.236     0.850000       307470         6.67
       1.269     0.875000       316532         8.00
       1.286     0.887500       320850         8.89
       1.306     0.900000       325425        10.00
       1.328     0.912500       329992        11.43
       1.353     0.925000       334492        13.33
       1.383     0.937500       338917        16.00
       1.401     0.943750       341247        17.78
       1.420     0.950000       343476        20.00
       1.442     0.956250       345785        22.86
       1.466     0.962500       348022        26.67
       1.496     0.968750       350238        32.00
       1.514     0.971875       351360        35.56
       1.534     0.975000       352490        40.00
       1.556     0.978125       353604        45.71
       1.581     0.981250       354742        53.33
       1.612     0.984375       355887        64.00
       1.630     0.985938       356424        71.11
       1.649     0.987500       356997        80.00
       1.673     0.989062       357571        91.43
       1.700     0.990625       358118       106.67
       1.732     0.992188       358690       128.00
       1.751     0.992969       358969       142.22
       1.776     0.993750       359255       160.00
       1.802     0.994531       359535       182.86
       1.834     0.995313       359815       213.33
       1.869     0.996094       360099       256.00
       1.893     0.996484       360237       284.44
       1.918     0.996875       360378       320.00
       1.958     0.997266       360519       365.71
       2.014     0.997656       360660       426.67
       2.113     0.998047       360801       512.00
       2.283     0.998242       360872       568.89
       2.863     0.998437       360943       640.00
       3.489     0.998633       361013       731.43
       4.275     0.998828       361084       853.33
       5.003     0.999023       361154      1024.00
       5.711     0.999121       361190      1137.78
       6.263     0.999219       361225      1280.00
       6.839     0.999316       361260      1462.86
       7.715     0.999414       361296      1706.67
       8.783     0.999512       361331      2048.00
       9.127     0.999561       361349      2275.56
       9.703     0.999609       361366      2560.00
      10.279     0.999658       361384      2925.71
      10.599     0.999707       361402      3413.33
      10.975     0.999756       361419      4096.00
      11.247     0.999780       361428      4551.11
      11.799     0.999805       361437      5120.00
      12.055     0.999829       361446      5851.43
      12.551     0.999854       361455      6826.67
      12.815     0.999878       361463      8192.00
      12.943     0.999890       361468      9102.22
      13.103     0.999902       361472     10240.00
      13.455     0.999915       361477     11702.86
      13.767     0.999927       361481     13653.33
      14.047     0.999939       361485     16384.00
      14.175     0.999945       361488     18204.44
      14.255     0.999951       361490     20480.00
      14.303     0.999957       361492     23405.71
      14.383     0.999963       361494     27306.67
      14.655     0.999969       361496     32768.00
      14.687     0.999973       361498     36408.89
      14.695     0.999976       361499     40960.00
      14.759     0.999979       361500     46811.43
      14.911     0.999982       361501     54613.33
      14.991     0.999985       361502     65536.00
      15.343     0.999986       361503     72817.78
      15.343     0.999988       361503     81920.00
      15.479     0.999989       361504     93622.86
      15.479     0.999991       361504    109226.67
      15.527     0.999992       361505    131072.00
      15.527     0.999993       361505    145635.56
      15.527     0.999994       361505    163840.00
      15.615     0.999995       361506    187245.71
      15.615     0.999995       361506    218453.33
      15.615     0.999996       361506    262144.00
      15.615     0.999997       361506    291271.11
      15.615     0.999997       361506    327680.00
      15.671     0.999997       361507    374491.43
      15.671     1.000000       361507          inf
#[Mean    =        0.806, StdDeviation   =        0.485]
#[Max     =       15.664, Total count    =       361507]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  361517 requests in 10.00s, 40.34MB read
Requests/sec:  36150.86
Transfer/sec:      4.03MB