benchmark/results/throughput_mc-vs-rust/RAW/flare-plaintext-throughput_mc-cal-53589.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  744.33us  16.42ms   86.73%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.07ms
 75.000%    1.45ms
 90.000%    1.77ms
 99.000%    2.37ms
 99.900%   11.61ms
 99.990%   14.98ms
 99.999%   16.18ms
100.000%   16.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.041     0.000000            1         1.00
       0.462     0.100000        52645         1.11
       0.638     0.200000       105372         1.25
       0.788     0.300000       157691         1.43
       0.932     0.400000       210541         1.67
       1.073     0.500000       263081         2.00
       1.144     0.550000       289343         2.22
       1.216     0.600000       315587         2.50
       1.290     0.650000       341759         2.86
       1.368     0.700000       368180         3.33
       1.450     0.750000       394196         4.00
       1.494     0.775000       407352         4.44
       1.541     0.800000       420681         5.00
       1.590     0.825000       433739         5.71
       1.644     0.850000       446837         6.67
       1.703     0.875000       460054         8.00
       1.735     0.887500       466503         8.89
       1.770     0.900000       473172        10.00
       1.808     0.912500       479664        11.43
       1.848     0.925000       486162        13.33
       1.894     0.937500       492770        16.00
       1.920     0.943750       496051        17.78
       1.948     0.950000       499330        20.00
       1.980     0.956250       502591        22.86
       2.017     0.962500       505885        26.67
       2.059     0.968750       509226        32.00
       2.083     0.971875       510819        35.56
       2.111     0.975000       512430        40.00
       2.145     0.978125       514101        45.71
       2.185     0.981250       515766        53.33
       2.231     0.984375       517381        64.00
       2.261     0.985938       518208        71.11
       2.297     0.987500       519036        80.00
       2.337     0.989062       519823        91.43
       2.393     0.990625       520660       106.67
       2.471     0.992188       521469       128.00
       2.527     0.992969       521875       142.22
       2.609     0.993750       522280       160.00
       2.785     0.994531       522692       182.86
       3.623     0.995313       523100       213.33
       4.983     0.996094       523512       256.00
       5.771     0.996484       523717       284.44
       6.699     0.996875       523921       320.00
       7.571     0.997266       524128       365.71
       8.391     0.997656       524332       426.67
       9.311     0.998047       524539       512.00
       9.751     0.998242       524640       568.89
      10.231     0.998437       524742       640.00
      10.663     0.998633       524846       731.43
      11.191     0.998828       524949       853.33
      11.663     0.999023       525052      1024.00
      11.975     0.999121       525102      1137.78
      12.207     0.999219       525155      1280.00
      12.495     0.999316       525204      1462.86
      12.807     0.999414       525258      1706.67
      13.071     0.999512       525307      2048.00
      13.247     0.999561       525334      2275.56
      13.447     0.999609       525358      2560.00
      13.607     0.999658       525384      2925.71
      13.807     0.999707       525410      3413.33
      14.087     0.999756       525435      4096.00
      14.223     0.999780       525448      4551.11
      14.303     0.999805       525461      5120.00
      14.455     0.999829       525474      5851.43
      14.663     0.999854       525487      6826.67
      14.847     0.999878       525500      8192.00
      14.895     0.999890       525506      9102.22
      15.023     0.999902       525512     10240.00
      15.159     0.999915       525519     11702.86
      15.263     0.999927       525525     13653.33
      15.383     0.999939       525531     16384.00
      15.479     0.999945       525536     18204.44
      15.487     0.999951       525538     20480.00
      15.559     0.999957       525541     23405.71
      15.623     0.999963       525544     27306.67
      15.655     0.999969       525547     32768.00
      15.719     0.999973       525549     36408.89
      15.775     0.999976       525552     40960.00
      15.775     0.999979       525552     46811.43
      15.855     0.999982       525554     54613.33
      15.871     0.999985       525555     65536.00
      15.943     0.999986       525556     72817.78
      16.175     0.999988       525557     81920.00
      16.183     0.999989       525558     93622.86
      16.231     0.999991       525560    109226.67
      16.231     0.999992       525560    131072.00
      16.231     0.999993       525560    145635.56
      16.231     0.999994       525560    163840.00
      16.263     0.999995       525561    187245.71
      16.263     0.999995       525561    218453.33
      16.263     0.999996       525561    262144.00
      16.399     0.999997       525562    291271.11
      16.399     0.999997       525562    327680.00
      16.399     0.999997       525562    374491.43
      16.399     0.999998       525562    436906.67
      16.399     0.999998       525562    524288.00
      16.431     0.999998       525563    582542.22
      16.431     1.000000       525563          inf
#[Mean    =        1.130, StdDeviation   =        0.744]
#[Max     =       16.416, Total count    =       525563]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  525593 requests in 10.00s, 58.65MB read
Requests/sec:  52555.07
Transfer/sec:      5.86MB